#pragma once

// Fortnite (1.6.4) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass BP_WuXiaHorseAnim.BP_WuXiaHorseAnim_C
// 0x3214 (0x3574 - 0x0360)
class UBP_WuXiaHorseAnim_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0360(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_EB34FD80440930A89624D2ACD876BFDA;      // 0x0368(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_670653D244BB3F6CC62D328579CBFB8A;// 0x03A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2864D7294661B68884D59DBDE1008F77;// 0x03F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_52D824D44CC358CA8DD7F78493FDB8E6;// 0x0438(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8E5B15DA409FBAE006507D9680E68C31;// 0x0480(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_03E0DA8443155F1BD40E4594E9D6B9ED;// 0x04C8(0x0048)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_AF20AB3A4F2E92177C525F9A9009DF19;// 0x0510(0x01E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7386D49E4220D0F19B2930BDDA47A61F;// 0x06F0(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_848B8EFC4BAE73AD7951038B228351FB;// 0x0818(0x00D0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_F9D36A6C40CEB3003BCFAB823F686B13;// 0x08E8(0x01E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_6E0DC4F64C6723AD4EB8A3AC279D9594;// 0x0AC8(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5661062D44CD80639F3D91B3A7823C7A;// 0x0BF0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9481944B40E3CAA512A3AD80A1FD461F;// 0x0C30(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7570E23347DC7548A35E2C9E5B0B797D;// 0x0CD0(0x0040)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_57A245024342634FB5668CAF087E0B91;// 0x0D10(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_73A82678475B296AF78EE5BD0351FCEA;// 0x0E00(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_67435ED34376FF2B337B808FFEB804F1;// 0x0EA0(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_49565BA04754F9F263B0808AFA81D8A2;// 0x0F40(0x0040)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_8D506C7A4E29C164266BCB89B6CC4AA4;// 0x0F80(0x01E0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_54F03F454A961C590EF03F91237EC957;// 0x1160(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_471B8BE34139C94BC88798B3CCE9E89C;// 0x11A8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_344D8F6D40570A41505E70B25564A14B;// 0x11F0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F65F083B4BCB73DF278A5ABF455529D0;// 0x1238(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4C37E6554797D32079CFF993BD29055E;// 0x1280(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_307C53444213840AE2335894B363AF83;// 0x12C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2492B39547E5C0CD5313579B1BAF80B0;// 0x1310(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F03377604F4F5A4F64228FB74C67C665;// 0x1358(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_55C25F98450FD6BDCB823EA33EE43600;// 0x13A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4007A45A40ACF2B9312360A38DD8F9DE;// 0x13E8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B24F9D3946A0369C1947D0A1EB3EF762;// 0x1430(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FF8ACA5F461BBF0A92B4FA8BC53E6324;// 0x14D0(0x0048)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_B78F6A1F44B8B77B1D79F4BC44A15A6B;// 0x1518(0x00F8)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CA032EC242D3DCDD237266920D1754A9;// 0x1610(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0C92183B4830C88B3383A2B9B35C79B6;// 0x1650(0x00A0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_9DE0A85A48383BF3E3443EBC4EBE8732;// 0x16F0(0x00F8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F94F7DAA4B10A50FCF22EE9DAAB38ACD;// 0x17E8(0x0048)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_1D4F633D49ACCC05911D7A83FEB0B14F;// 0x1830(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_001217394416D5D0067B19ADDD488F58;// 0x1870(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_07D463244020D25B30DE2784D49ECC97;// 0x18B8(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_AA55E30149889DE87AD2008611A23B85;// 0x1958(0x00D8)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_D1D433A74F6460DACCFBE1A5180A0409;// 0x1A30(0x00F0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2EA83A094CBDF6112EA2CA8491A0CB12;// 0x1B20(0x0048)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CCBB46034AF928488B1526BEF45988B2;// 0x1B68(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_0D1BE68D48E24C229D924DA75FD37CD5;// 0x1BA8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B4F81FE04D8BA639AE7770B2F1703CBD;// 0x1BF0(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_31DF52A7413663C59D658AA94D8C1C00;// 0x1C90(0x00F0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8EB47E2A4194E93A61AD3FAEA64B06BF;// 0x1D80(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_53F6AFD2424A24F688E761A5E8F1C05C;// 0x1DC0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E691E9014C855D08B1A9268AB725B70C;// 0x1E08(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_19A20C164D714FDB0DFAA0BD550248E8;// 0x1EA8(0x00F0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_378918024A241D09944F699DE98E8503;// 0x1F98(0x0040)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_F55DBDAC476FD9101D62B494CE3CBA21;// 0x1FD8(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_583E452A4D5AB8D386AA0A88925C8154;// 0x20C8(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_CBBBC0E343C5D8B1AA80F4BCBF9B459B;// 0x2168(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3BD0698C41754038E2FB4DAA14DAD562;// 0x2240(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B11388C74AF79EBC3E95F2BCC35FD98A;// 0x2288(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_214A44FC4017B634E2C9E8B03658B0B3;// 0x2328(0x00F0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_705A300D416BEBA56CAE5B89A55E53C5;// 0x2418(0x0048)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AB69B8D3432ED7128BB4C2BC6BAB502E;// 0x2460(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2EA051DD48CD9388E3D809BA3FAC313D;// 0x24A0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C38875264FDC4EA002FED096680C5E2F;// 0x24E8(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_F957452E4F11171AB0C63497BEF419CA;// 0x2588(0x00F0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_76D675E647AE144F0024A786FF878598;// 0x2678(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_2E7C7F1246A5FC9D34CCC1BDC90C6E60;// 0x26B8(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_75B3C5724595495E521AFCA39E695FBA;// 0x2798(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_2628B41648CA1EA3BF27948592BDB60B;// 0x27D8(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_649C37FD4929974B65AF70A03FE105BA;// 0x28B8(0x0128)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E6E73CE64E0E437AE457B097A56989EE;// 0x29E0(0x0138)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_9ED6DF9A4D3848EB852DF6AD3D6A9624;// 0x2B18(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_D2523CF846823F1CB599539F3F76A294;// 0x2B58(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_D0154A194D642896E035AA90BFD1B744;// 0x2B98(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5EC3E2FB4262E21A88DFBD97084DF4F2;// 0x2CD0(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1DF9782144B26E5E9779F7A2CD93DD9D;// 0x2E08(0x0138)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_75BF2D984DA7029138EF92B5724CCBE8; // 0x2F40(0x0240)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_B0BF7E474A092EB270253399DB46FC56; // 0x3180(0x0240)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_5CD65B394414D6343684DEA4CBF20721;// 0x33C0(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_DBB402034E03B544FA233388E7345E21;      // 0x3498(0x0068)
	class USkeletalMeshComponent*                      HorseMesh;                                                // 0x3500(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData)
	float                                              moveSpeed;                                                // 0x3508(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimOffset;                                                // 0x350C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     IKFootBRLocation;                                         // 0x3510(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     IKFootBLLocation;                                         // 0x351C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     IKFootFRLocation;                                         // 0x3528(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     IKFootFLLocation;                                         // 0x3534(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class ABP_WuXiaHorse_C*                            HorsePawn;                                                // 0x3540(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     R_default_location;                                       // 0x3548(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     L_default_location;                                       // 0x3554(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsJump_;                                                  // 0x3560(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x3561(0x0003) MISSED OFFSET
	struct FRotator                                    Rotation;                                                 // 0x3564(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RotSpeed;                                                 // 0x3570(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass BP_WuXiaHorseAnim.BP_WuXiaHorseAnim_C");
		return ptr;
	}


	void UpdateValues();
	void IsPlayerJumpOnHorse_();
	void GetFootIKLocation(const struct FName& InBoneName, float Add, const struct FVector& default_value, struct FVector* OutLocation);
	void SetMeshRotation(const struct FRotator& Rotation, float Speed);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_TransitionResult_4C37E6554797D32079CFF993BD29055E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_TransitionResult_307C53444213840AE2335894B363AF83();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_TransitionResult_2492B39547E5C0CD5313579B1BAF80B0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_TransitionResult_F03377604F4F5A4F64228FB74C67C665();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_TransitionResult_55C25F98450FD6BDCB823EA33EE43600();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_TransitionResult_4007A45A40ACF2B9312360A38DD8F9DE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_TransitionResult_471B8BE34139C94BC88798B3CCE9E89C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_BlendListByBool_848B8EFC4BAE73AD7951038B228351FB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_TwoWayBlend_9DE0A85A48383BF3E3443EBC4EBE8732();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_TransitionResult_F65F083B4BCB73DF278A5ABF455529D0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_TransitionResult_03E0DA8443155F1BD40E4594E9D6B9ED();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_ApplyAdditive_F55DBDAC476FD9101D62B494CE3CBA21();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_TransitionResult_2864D7294661B68884D59DBDE1008F77();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_ModifyBone_E6E73CE64E0E437AE457B097A56989EE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_ModifyBone_D0154A194D642896E035AA90BFD1B744();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_ModifyBone_5EC3E2FB4262E21A88DFBD97084DF4F2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_ModifyBone_1DF9782144B26E5E9779F7A2CD93DD9D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_TwoBoneIK_75BF2D984DA7029138EF92B5724CCBE8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_TwoBoneIK_B0BF7E474A092EB270253399DB46FC56();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_TransitionResult_344D8F6D40570A41505E70B25564A14B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_TransitionResult_54F03F454A961C590EF03F91237EC957();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_WuXiaHorseAnim_AnimGraphNode_TransitionResult_670653D244BB3F6CC62D328579CBFB8A();
	void BlueprintUpdateAnimation(float* DeltaTimeX);
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_BP_WuXiaHorseAnim(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
