#pragma once

// Fortnite (1.6.4) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class WuXiaX.AINetMessageHandle
// 0x0048 (0x0370 - 0x0328)
class AAINetMessageHandle : public AActor
{
public:
	class AActor*                                      Horse_class;                                              // 0x0328(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     ai_ip_;                                                   // 0x0330(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config)
	int                                                ai_port_;                                                 // 0x0340(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0344(0x0004) MISSED OFFSET
	struct FString                                     server_ip_;                                               // 0x0348(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config)
	int                                                server_port_;                                             // 0x0358(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x035C(0x0004) MISSED OFFSET
	class AWuXiaXCharacter*                            player_obj_;                                              // 0x0360(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0368(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.AINetMessageHandle");
		return ptr;
	}


	void SendPickItemReponse();
	void SendPickItem();
	void SendAllPickItem();
	void SendActorInfo();
	void OnItemGetResult(int Type, bool result);
	bool ConnectServer();
	bool ConnectAIServer(class AWuXiaXCharacter* Obj);
};


// Class WuXiaX.AreaBox
// 0x0018 (0x0340 - 0x0328)
class AAreaBox : public AActor
{
public:
	int                                                area_index_;                                              // 0x0328(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              area_min_chance_;                                         // 0x032C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              area_max_chance_;                                         // 0x0330(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0334(0x0004) MISSED OFFSET
	class UBoxComponent*                               box_collision_;                                           // 0x0338(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.AreaBox");
		return ptr;
	}

};


// Class WuXiaX.BagUI
// 0x0000 (0x0208 - 0x0208)
class UBagUI : public UUserWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.BagUI");
		return ptr;
	}


	void Vertical(bool State, bool IsDown);
	void UseHoverItem();
	void ShowItemDetail(const struct FUIItemInfo& UIItemInfo);
	void ShowBagUI();
	void SetWeight(const struct FString& maxweight, const struct FString& Weight);
	void SetSplitItemButton(bool isbottondown);
	void SetPlayerName(const struct FString& Name);
	void SetItemHotKey(int index, class UTexture2D* icon, int Number);
	void SetItem(EBagType bagtype, int index, int Level, const struct FString& Name, int Number, int itemtype, class UTexture2D* icon, class UTexture2D* dragicon);
	void SetDurableValue(EBagType bag_type, int index, int armor);
	void SetDragItemInfo(int itemnumber, int pickid);
	void SelectHoverItem();
	void RemoveItem(EBagType bagtype, int index);
	void ReLoadConfigShow();
	void NextLabel();
	void MarkHoverItem(EGamepadMarkType MarkType);
	void LastLabel();
	void Init();
	void Horizontal(bool State, bool IsRight);
	void HideBagUI();
	int GetTypeByBagIndex(EBagType bag, int index);
	class AWuXiaXCharacter* GetLocalCharacter();
	bool GetCharacterShowState();
	void GamepadIntoWidget();
	void EndKeepAction();
	void DropHoverItem();
	void ClearItemHotKey(int index);
	void ClearInventory();
};


// Class WuXiaX.BuffEffectLibrary
// 0x0000 (0x0028 - 0x0028)
class UBuffEffectLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.BuffEffectLibrary");
		return ptr;
	}

};


// Class WuXiaX.BuffPoint
// 0x0070 (0x0398 - 0x0328)
class ABuffPoint : public AActor
{
public:
	TArray<int>                                        buff_ids_;                                                // 0x0328(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<EBuffPointType>                             buff_types_;                                              // 0x0338(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<int>                                        buff_chance_;                                             // 0x0348(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                spawn_min_time_;                                          // 0x0358(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                spawn_max_time_;                                          // 0x035C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0360(0x0008) MISSED OFFSET
	int                                                client_show_index_;                                       // 0x0368(0x0004) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x036C(0x0004) MISSED OFFSET
	class UBoxComponent*                               collision_component_;                                     // 0x0370(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	int                                                buff_index_;                                              // 0x0378(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x1C];                                      // 0x037C(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.BuffPoint");
		return ptr;
	}


	void OnOverlapEnd(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex);
	void OnOverlapBegin(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnBuffIdUpdate();
	void Client_OnBuffIdUpdate(int showid);
};


// Class WuXiaX.CharacterConfigUI
// 0x0000 (0x0208 - 0x0208)
class UCharacterConfigUI : public UUserWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.CharacterConfigUI");
		return ptr;
	}


	void InitData();
	void CreateModel(int ID, ESexType sex_type, EModelType model_type, class UTexture2D* normal_texture);
	void CreateColor(int ID, EModelType Type, const struct FLinearColor& Color);
};


// Class WuXiaX.CheckSoundActor
// 0x0008 (0x0330 - 0x0328)
class ACheckSoundActor : public AActor
{
public:
	int                                                player_id_;                                               // 0x0328(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                index_;                                                   // 0x032C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.CheckSoundActor");
		return ptr;
	}


	void UpdateLocation(const struct FVector& new_location);
	void Init(int player_id, int index);
};


// Class WuXiaX.CircleSliderUI
// 0x0000 (0x0208 - 0x0208)
class UCircleSliderUI : public UUserWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.CircleSliderUI");
		return ptr;
	}


	struct FVector GetCrossPoint(const struct FVector& circle_pos, const struct FVector& line_start, const struct FVector& line_end, float Radius);
};


// Class WuXiaX.ClientAchievementComponent
// 0x00B8 (0x01A8 - 0x00F0)
class UClientAchievementComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0xA8];                                      // 0x00F0(0x00A8) MISSED OFFSET
	class AWuXiaXCharacter*                            m_Player;                                                 // 0x0198(0x0008) (ZeroConstructor, IsPlainOldData)
	class UWuXiaXGameInstance*                         m_GameInstance;                                           // 0x01A0(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.ClientAchievementComponent");
		return ptr;
	}

};


// Class WuXiaX.WuXiaXHUDBase
// 0x0008 (0x0420 - 0x0418)
class AWuXiaXHUDBase : public AHUD
{
public:
	EWidgetInteractiveType                             current_interactive_type_;                                // 0x0418(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0419(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.WuXiaXHUDBase");
		return ptr;
	}


	void SetInteractiveType(EWidgetInteractiveType Type);
	void ReUMGEffect();
	void CheckResetFocus();
	void CheckFullScreenToWindowFullScreen();
	bool CanUseInteractive(EWidgetInteractiveType Type);
};


// Class WuXiaX.ClientLoginHUD
// 0x0008 (0x0428 - 0x0420)
class AClientLoginHUD : public AWuXiaXHUDBase
{
public:
	class UMainLoginUI*                                MianLoginUI;                                              // 0x0420(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.ClientLoginHUD");
		return ptr;
	}


	void ShowSorting();
	void ShowReconnect();
	void ShowLogoUI();
	void ShowLoginUI();
	void ShowHallWidget(const struct FString& player_name);
	void ReadyGame();
	void LoginResponse(ELoginResponseType login_state, const struct FString& player_name);
	void HideSorting();
	void HideReconnect();
	void HideLogoUI();
	void HideLoginUI();
	void CreateMainLoginUI();
	void CreateHallSkin(int skin_id, int Num);
	void CreateHallItem(int item_id, int Num);
	void AutoLogin();
};


// Class WuXiaX.ClientLoginPawn
// 0x00E8 (0x0470 - 0x0388)
class AClientLoginPawn : public APawn
{
public:
	bool                                               is_always_talk_;                                          // 0x0388(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               is_in_voice_channel_;                                     // 0x0389(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x96];                                      // 0x038A(0x0096) MISSED OFFSET
	struct FString                                     voice_channel_name_;                                      // 0x0420(0x0010) (ZeroConstructor)
	int                                                voice_channel_mode_;                                      // 0x0430(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0434(0x0004) MISSED OFFSET
	TArray<int>                                        voice_players_;                                           // 0x0438(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData02[0x28];                                      // 0x0448(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.ClientLoginPawn");
		return ptr;
	}


	void SetVoiceMode(int Mode);
	void SetAlwaysTalk(bool isalways);
	void MuteLocalAudio(bool bMuted);
};


// Class WuXiaX.ClientNetMessageHandle
// 0x0370 (0x0698 - 0x0328)
class AClientNetMessageHandle : public AActor
{
public:
	bool                                               is_sorting_;                                              // 0x0328(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               is_ping_net_callback_;                                    // 0x0329(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_connected_;                                            // 0x032A(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x032B(0x0001) MISSED OFFSET
	int                                                connect_counter_;                                         // 0x032C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FString                                     connect_str_;                                             // 0x0330(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x28];                                      // 0x0340(0x0028) MISSED OFFSET
	struct FString                                     ip_;                                                      // 0x0368(0x0010) (ZeroConstructor)
	int                                                port_;                                                    // 0x0378(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x037C(0x0004) MISSED OFFSET
	struct FString                                     user_name_;                                               // 0x0380(0x0010) (ZeroConstructor)
	int                                                money_;                                                   // 0x0390(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0394(0x0004) MISSED OFFSET
	int64_t                                            login_gateway_session_id_;                                // 0x0398(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     login_gateway_passwd_;                                    // 0x03A0(0x0010) (ZeroConstructor)
	ESexType                                           user_sex_;                                                // 0x03B0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x03B1(0x0003) MISSED OFFSET
	int                                                face_id_;                                                 // 0x03B4(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                hair_id_;                                                 // 0x03B8(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                skin_color_id_;                                           // 0x03BC(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                hair_color_id_;                                           // 0x03C0(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                buy_key_id_;                                              // 0x03C4(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                friend_id_;                                               // 0x03C8(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               is_team_;                                                 // 0x03CC(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x03CD(0x0003) MISSED OFFSET
	int                                                play_mode_;                                               // 0x03D0(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                server_id_;                                               // 0x03D4(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0xE0];                                      // 0x03D8(0x00E0) MISSED OFFSET
	TMap<int, bool>                                    team_player_room_state_;                                  // 0x04B8(0x0050) (ZeroConstructor)
	TMap<int, int>                                     item_map_;                                                // 0x0508(0x0050) (ZeroConstructor)
	TMap<int, int>                                     skin_map_;                                                // 0x0558(0x0050) (ZeroConstructor)
	TMap<int, int>                                     item_equip_map_;                                          // 0x05A8(0x0050) (ZeroConstructor)
	TMap<int, int>                                     skin_equip_map_;                                          // 0x05F8(0x0050) (ZeroConstructor)
	TMap<int, bool>                                    skin_preview_map_;                                        // 0x0648(0x0050) (ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.ClientNetMessageHandle");
		return ptr;
	}


	void StartTick(const struct FUIRoomInfo& room);
	void StartGame(const struct FUIRoomInfo& room);
	void SetOnlineState(int State);
	void SendTeamInviteResponse(int send_id, int result);
	void SendTeamInvite(const struct FString& Name);
	void SendTeamDataRequest();
	void SendReconstructCharacterCreateInfo(const struct FString& user_name, int user_hair, int user_face, ESexType user_sex, int user_skin, int user_hairco);
	void SendReconnect();
	void SendQuitTeamRequest();
	void SendPlayerName(const struct FString& Name);
	void SendMoneyRequest();
	void SendLoginMsg(const struct FString& user_name, const struct FString& PassWord, int Type);
	void SendLineUp(int line_mode, int server_mode, int play_mode);
	void SendItemRequest();
	void SendGoodsItemRequest();
	void SendFriendRequest();
	void SendFriendInviteResponse(int send_id, int result);
	void SendFriendInvite(const struct FString& Name);
	void SendEquipChange(int origin_item_id, int new_item_id);
	void SendCoinRequest();
	void SendCharacterCreateInfo(const struct FString& user_name, int user_hair, int user_face, ESexType user_sex, int user_skin, int user_hairco);
	void SendCancelLineUp();
	void SellItem(int item_id);
	void RequestRankInfo(int sort_type, int rank_type, int server_type);
	void RequestPlayerRankInfo(int player_id, int sort_type, int server_type);
	void RefreshPlatformGoodsItem();
	void QuitTick(const struct FUIRoomInfo& room);
	void Port(int Val);
	void PlayerReconnectOB(bool ok);
	void PlayerLeaveRoom(ELeaveRoomType Type, int player_id, const struct FUIRoomInfo& room);
	void PingCallBack();
	void OpenBox(int item_id);
	void JoinRoom(const struct FUIRoomInfo& room, const struct FString& PassWord);
	void JiHuoMa(const struct FString& ma);
	void Ip(const struct FString& Val);
	void GetRooms(int room_type, const struct FString& Tile, int play_mode, int server_id, int min_player_num, int max_player_num);
	void GetPage(int page);
	void DeleteRoom(const struct FUIRoomInfo& room);
	void DeleteFriend(int player_id);
	void CurrentServerChange();
	void CreateRoom(int play_mode, int map_id, const struct FString& room_tile, const struct FString& PassWord, int max_player_num, int team_player_num, int max_watch_num, int preset_mode, int server_id, bool add_flag);
	void CreateNewConnect();
	void ClientCheckMsg(float DeltaTime);
	void ChangeShowSkinIndex(TArray<int> Types);
	void ChangePlayerRole(int player_id, ERoleType new_type, int team_index, const struct FUIRoomInfo& room);
	void ChangeEquipSkin(int skin_id, int Type);
	bool CanLineUp();
	void CancelLogin();
	void BuyKey(int item_id);
	void BuyItem(int item_id);
};


// Class WuXiaX.ComponentMiddle
// 0x0030 (0x0120 - 0x00F0)
class UComponentMiddle : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x00F0(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.ComponentMiddle");
		return ptr;
	}


	EPlayerMotionState State_GetPlayerMotionState();
	EPlayerGameState State_GetPlayerMainState();
	bool State_ChangePlayerState(EPlayerGameState Val);
	bool State_ChangePlayerMotionState(EPlayerMotionState Val);
	bool State_ChangePlayerChildState(EPlayerFightState Val);
	bool Property_ReSetDyingHp();
	bool Property_ChangeSaveChangeValue(bool isadd, EPropertyChangeReason reason);
	bool Move_SwitchMovementModeEvent(TEnumAsByte<EMovementMode> Mode);
};


// Class WuXiaX.ConfigEnvironmentActor
// 0x0008 (0x0330 - 0x0328)
class AConfigEnvironmentActor : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0328(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.ConfigEnvironmentActor");
		return ptr;
	}


	float GetSoundVolume(const struct FString& float_value_name, const struct FString& bool_value_name);
	void EffectSoundVolume();
};


// Class WuXiaX.CreateMapUI
// 0x0000 (0x0208 - 0x0208)
class UCreateMapUI : public UUserWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.CreateMapUI");
		return ptr;
	}


	TArray<int> GetMapsByPlayMode(int play_mode);
	class UTexture2D* GetMapInfo(int map_id, struct FString* Name);
};


// Class WuXiaX.CustomGameUI
// 0x0020 (0x0228 - 0x0208)
class UCustomGameUI : public UUserWidget
{
public:
	int                                                current_state_sort_;                                      // 0x0208(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                current_player_num_sort_;                                 // 0x020C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                taosha_min_player_num_;                                   // 0x0210(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	int                                                luandou_player_num_;                                      // 0x0214(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	int                                                taosha_max_team_player_num_;                              // 0x0218(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	int                                                luandou_team_player_num_;                                 // 0x021C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	bool                                               taosha_viewer_state_;                                     // 0x0220(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	bool                                               luandou_viewer_state_;                                    // 0x0221(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0222(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.CustomGameUI");
		return ptr;
	}


	TArray<class URoomChildUI*> SortRoomChild(TArray<class URoomChildUI*> roominfos);
	struct FString GetValidPassword(const struct FString& old_pwd);
	void CreateRoomInfos(TArray<struct FUIRoomInfo> roominfos);
};


// Class WuXiaX.DamageCircleActor
// 0x00A8 (0x03D0 - 0x0328)
class ADamageCircleActor : public AActor
{
public:
	TArray<struct FVector2D>                           map_range_;                                               // 0x0328(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              height_;                                                  // 0x0338(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              location_z;                                               // 0x033C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<float>                                      damages_;                                                 // 0x0340(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<float>                                      wait_times_;                                              // 0x0350(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<float>                                      shrink_times_;                                            // 0x0360(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              damage_rate_;                                             // 0x0370(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0374(0x0004) MISSED OFFSET
	TArray<float>                                      shrink_speeds_;                                           // 0x0378(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              win_location_check_angle_;                                // 0x0388(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              win_actor_radius_;                                        // 0x038C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x40];                                      // 0x0390(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.DamageCircleActor");
		return ptr;
	}


	void Start();
	void Client_StartLastCircle();
	bool CheckActorIsLandscape(class AActor* Actor);
};


// Class WuXiaX.FakeCharacter
// 0x0068 (0x0390 - 0x0328)
class AFakeCharacter : public AActor
{
public:
	class USkeletalMeshComponent*                      mesh_body_;                                               // 0x0328(0x0008) (Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	struct FVector                                     move_location;                                            // 0x0330(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     old_move_location;                                        // 0x033C(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    move_rotation;                                            // 0x0348(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               move_flag;                                                // 0x0354(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               horse_flag;                                               // 0x0355(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0356(0x0002) MISSED OFFSET
	class USkeletalMesh*                               load_skeletal_obj;                                        // 0x0358(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x30];                                      // 0x0360(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.FakeCharacter");
		return ptr;
	}


	void UpdateMesh();
	void LoadComplete();
};


// Class WuXiaX.GameEventInterface
// 0x0000 (0x0028 - 0x0028)
class UGameEventInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.GameEventInterface");
		return ptr;
	}

};


// Class WuXiaX.GameRebirthActor
// 0x0018 (0x0340 - 0x0328)
class AGameRebirthActor : public AActor
{
public:
	struct FVector                                     point_offest_;                                            // 0x0328(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	ELivePointType                                     Type;                                                     // 0x0334(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0335(0x0003) MISSED OFFSET
	int                                                index;                                                    // 0x0338(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x033C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.GameRebirthActor");
		return ptr;
	}

};


// Class WuXiaX.HorseRideComponent
// 0x0070 (0x0160 - 0x00F0)
class UHorseRideComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x00F0(0x0030) MISSED OFFSET
	EPlayerRideStateType                               ride_state_net_;                                          // 0x0120(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0121(0x0007) MISSED OFFSET
	class AWuXiaXHorse*                                ride_horse_net_;                                          // 0x0128(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	EPlayerRideStateType                               ride_state_net_other_;                                    // 0x0130(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0131(0x0007) MISSED OFFSET
	class AWuXiaXHorse*                                ride_horse_net_other_;                                    // 0x0138(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x14];                                      // 0x0140(0x0014) MISSED OFFSET
	float                                              server_tick_;                                             // 0x0154(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              client_tick_;                                             // 0x0158(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              owner_tick_;                                              // 0x015C(0x0004) (ZeroConstructor, Config, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.HorseRideComponent");
		return ptr;
	}


	void Server_SetLastRotation(const struct FRotator& lastrotation);
	void Server_Ride(int horse_net_id);
	void Server_InputRight(float Value);
	EPlayerRideStateType Ride_state_net();
	class AWuXiaXHorse* Ride_horse_net();
	void OnRedRideStateOther();
	void OnRedRideState();
	void OnRedHorseOther();
	void OnRedHorse();
	float GetRotationSpeed();
	void Client_Ride_Rotation(const struct FRotator& Rotation);
};


// Class WuXiaX.InteractiveInterface
// 0x0000 (0x0028 - 0x0028)
class UInteractiveInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.InteractiveInterface");
		return ptr;
	}


	bool InteractiveUITips(class AWuXiaXCharacter* Player, struct FText* Text);
	EInteractiveType GetInteractiveType(class AWuXiaXCharacter* Player);
	bool CanInteractive(class AWuXiaXCharacter* Player, ETriggerInteractiveType Trigger);
};


// Class WuXiaX.ItemEffectFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UItemEffectFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.ItemEffectFunctionLibrary");
		return ptr;
	}

};


// Class WuXiaX.ItemParticlesEffect
// 0x0040 (0x0368 - 0x0328)
class AItemParticlesEffect : public AActor
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0328(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.ItemParticlesEffect");
		return ptr;
	}

};


// Class WuXiaX.KeepActionUI
// 0x0000 (0x0208 - 0x0208)
class UKeepActionUI : public UUserWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.KeepActionUI");
		return ptr;
	}


	void SetKeepAction(float CurrentTime);
	void Init();
	void EndKeepAction();
	void BeginKeepAction(float actiontime);
};


// Class WuXiaX.LoadAssetManager
// 0x00D8 (0x0100 - 0x0028)
class ULoadAssetManager : public UObject
{
public:
	unsigned char                                      UnknownData00[0xD8];                                      // 0x0028(0x00D8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.LoadAssetManager");
		return ptr;
	}


	bool LoadAsset(const struct FSoftObjectPath& AssetName, class UObject* Actor, class UObject* Component);
	bool AsyncLoadAsset(const struct FSoftObjectPath& AssetName, class UObject* Actor, class UObject* Component);
};


// Class WuXiaX.LoadingUI
// 0x0000 (0x0208 - 0x0208)
class ULoadingUI : public UUserWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.LoadingUI");
		return ptr;
	}


	void SetPercent(float percent);
};


// Class WuXiaX.LoadInterface
// 0x0000 (0x0028 - 0x0028)
class ULoadInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.LoadInterface");
		return ptr;
	}


	bool LoadComplete(class UObject* Component, const struct FSoftObjectPath& asset_ref);
};


// Class WuXiaX.LoadProgressManager
// 0x0090 (0x03B8 - 0x0328)
class ALoadProgressManager : public AActor
{
public:
	int                                                mapindex;                                                 // 0x0328(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              virtual_progress_value_;                                  // 0x032C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              actually_progress_value_;                                 // 0x0330(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                current_level_num_;                                       // 0x0334(0x0004) (ZeroConstructor, IsPlainOldData)
	class AWuXiaXHUD*                                  hud_;                                                     // 0x0338(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0340(0x0008) MISSED OFFSET
	int                                                anti;                                                     // 0x0348(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                postprocess;                                              // 0x034C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                shadow;                                                   // 0x0350(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Texture;                                                  // 0x0354(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                particle;                                                 // 0x0358(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Foliage;                                                  // 0x035C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                view_distance;                                            // 0x0360(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               vsync;                                                    // 0x0364(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x53];                                      // 0x0365(0x0053) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.LoadProgressManager");
		return ptr;
	}


	void LoadLevelComplete();
	void GamingLoadLevelComplete();
};


// Class WuXiaX.MainGameUI
// 0x0020 (0x0228 - 0x0208)
class UMainGameUI : public UUserWidget
{
public:
	class UUserSettingWidget*                          usersetting_UI_;                                          // 0x0208(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UStatisticsWidget*                           userstatistics_UI_;                                       // 0x0210(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	EPlayerGameUIState                                 current_ui_state_;                                        // 0x0218(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0219(0x0007) MISSED OFFSET
	class UWuXiaMiniMapWidget*                         mini_map_;                                                // 0x0220(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.MainGameUI");
		return ptr;
	}


	void ZeroTextState(bool State);
	void UpdateWeaponStateEffect(int weaponindex, class UTexture2D* effecticon, int Value);
	void UpdateTeamPlayerState(int Num, ETeamPlayerState new_state);
	void UpdateTeamPlayerHPPercent(int Num, float Value);
	void UpdateTeamPlayerDyingHPPercent(int Num, float Value);
	void UpdateSoundLocation(int ID, const struct FVector& NewLocation);
	void UpdateSatiety(float satietyvalue);
	void UpdatePlayerState(EPlayerGameState new_state);
	void UpdatePlayerRotator(int Num, float Yaw);
	void UpdatePlayerMark3DLocation(int Num, const struct FVector& Location);
	void UpdatePlayerLocation(int Num, const struct FVector& Location);
	void UpdateOxygen(float oxygen);
	void UpdateMp(float currentMP, float currentmaxMP, float maxMP);
	void UpdateMoisture(float moisture);
	void UpdateLiveData(int LIVE);
	void UpdateKiteSpeed(float Speed);
	void UpdateKillData(int kill);
	void UpdateItemNumber(int index, int Number);
	void UpdateInjury(float injury);
	void UpdateHorseSpeed(float current_speed, float max_speed);
	void UpdateHorsePower(float current_power, float max_power);
	void UpdateFightHp(float currentHP, float maxHP);
	void UpdateDyingHp(float currentHP, float maxHP);
	void UpdateDrugValue(float drugvalue);
	void UpdateCompass(float Angle);
	void UpdateCheckSoundCD(float current_cd, float max_cd);
	void ShowWarning(const struct FString& Text);
	void ShowOxygen();
	void ShowMainInterfaceUI();
	void ShowInteractive(const struct FText& Text);
	void ShowDamageCircle();
	void ShowCrossHair();
	void ShowCheckSoundLocation(int Ids, const struct FVector& Location);
	void SetZeroTimer(int Timer);
	void SetWeaponState(int weaponindex, int Value, class UTexture2D* effecticon, class UTexture2D* weaponicon);
	void SetTeamPlayerShowMode(int teammode);
	void SetSplitItemButton(bool isbottondown);
	void SetSkillHotKey(int index, int skill_id, class UTexture2D* icon, float skillcd, bool canuse);
	void SetSkillCurrentCD(int skill_id, float skillcd);
	void SetMainInterfaceState(bool State);
	void SetLifeInfoState(bool State);
	void SetKiteState(bool new_state);
	void SetKeepActionTime(float current_time);
	void SetItemHotKey(int index, class UTexture2D* icon, int Number);
	void SetHorseState(bool new_state);
	void SetGeneralState(bool State);
	void SetGeneralInfo(class UTexture2D* icon, int ID, float max_cd);
	void SetDamageCircleWaitingTime(float Time);
	void SetDamageCircleState(EDamageCircleState State);
	void SetDamageCircleShringkingTime(float CurrentTime, float alltime);
	void SetCheckSoundSkillState(bool State);
	void SetBuff(int buffID, int numberoflayer, float Time, class UTexture2D* icon);
	void ResetLanguage();
	void RemoveWeaponState(int weaponindex);
	void RemoveSound(int ID);
	void RemoveBuff(int buffID);
	void ReLoadConfigShow();
	void PlayerUnLockToOther();
	void PlayerTalk(int player_id);
	void PlayerLockToOther();
	void PickUpOverWeight();
	void PickGetItem(bool State, class UTexture2D* Texture, int Level, bool learned);
	void MissileHitTarget();
	bool IsInitTeamPlayer(int PlayerID);
	void InitTeamPlayer(int PlayerID, const struct FString& Name, int index, int teammode);
	void InitCheckSoundSkill(int skill_id, class UTexture2D* icon, float max_cd);
	void InitCheckSound();
	void Init();
	void HideOxygen();
	void HideMainInterfaceUI();
	void HideInteractive();
	void HideDamageCircle();
	void HideCrossHair();
	bool GetWeaponShowState();
	void GetSlotItemInfo(EBagType bagtype, int Number, struct FUIItemInfo* slotiteminfo);
	int GetPostColorType();
	class AWuXiaXCharacter* GetLocalCharacter();
	bool GetDressShowState();
	void EndKeepAction();
	void DeleteTeamPlayerMarkState(int Num);
	void ClearTeamPlayerName(int index);
	void ClearSkillHotKey(int index);
	void ClearItemHotKey(int index);
	void ClearBuffs();
	void ChangeCurrentWeapon(int weaponindex);
	void CanNotShooter();
	void CanNotEquipItem();
	void BeginKeepAction(float actiontime);
	void AppendKillInfo(const struct FString& attack_player_name, const struct FString& dead_player_name, int cause_id, ECauseDyingType reason);
	void AppendGongGao(EGongGaoType Type, const struct FText& Info);
	void ActiveComplain();
};


// Class WuXiaX.MainLoginUI
// 0x0028 (0x0230 - 0x0208)
class UMainLoginUI : public UUserWidget
{
public:
	struct FScriptMulticastDelegate                    on_item_change_;                                          // 0x0208(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               is_debug_;                                                // 0x0218(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0219(0x0007) MISSED OFFSET
	struct FString                                     connect_str_;                                             // 0x0220(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.MainLoginUI");
		return ptr;
	}


	void UpdateVersion();
	void UpdateUserMoney(int money);
	void UpdateRoomPlayer(const struct FRoomUser& user);
	void TeamPlayerTalk(int player_id);
	void TeamPlayerRoomStateChange(int player_id, bool State);
	void TeamPlayerEquipChange(int old_item_id, int new_item_id, int user_id);
	void TeamChangeLook(int player_id, ESexType sex, const struct FString& Name, int user_face, int skin_color, int user_hair, int user_haircolor, class UTexture2D* icon);
	void StartRoomTick();
	void SoldItemComplete();
	void ShowLoginWidget();
	void ShowInputName();
	void ShowCreateCharacter(const struct FString& Name);
	void SetUserRank(const struct FWuXiaX_FUserRank& rank, int player_id);
	void SetTeamMode(int Mode);
	void SetSkinSelectId(int skin_id, int Type, class UTexture2D* icon_texture);
	void SetServerMode(int server_id);
	void SetPreviewSkin(int player_id, EPreviewType Type, int skin_id);
	void SetPlayModeState(int Mode, int State);
	void SetPlayModeEndTime(int Mode, int days, int Hours, int Minutes, bool is_start);
	void SetPlayMode(int Mode);
	void SetPLayerLoginState(int user_id, int login_state);
	void SetPingTaiLogin(const struct FString& user_name, const struct FString& PassWord, int Type, ESlateVisibility showCancle);
	void SetPageNum(int Num);
	void SetOnlineType(int online_type);
	void SetMaxPage(int page);
	void SetLeaveTeamButtonValid(bool State);
	void SetIsMasterMode(bool State);
	void SetFriendYSState(int user_id, int login_state);
	void SetFriendInfo(int ID, const struct FString& Name, int login_state, int ys_state, class UTexture2D* icon);
	void SaveUserName(const struct FString& Value);
	void SavePassWord(const struct FString& Value);
	void ResetVicRank(TArray<struct FVictoryRank> vic_rank);
	void ResetTotalRank(TArray<struct FTotalRank> total_rank);
	void ResetServerListLanguageInfo();
	void ResetHallItemLanguageInfo();
	void ResetGoodsLanguage();
	void ResetFightRank(TArray<struct FFightRank> fight_rank);
	void RemoveHallSkin(int skin_id);
	void RemoveHallItem(int item_id);
	void ReCalculateBoxPrice(int item_id, int Times);
	void QuitRoomTick();
	void QuitFromRoom();
	void PopOBReconnect();
	void PlayerQuitTeam();
	void PlayerNameRepeat();
	void PlayerLeaveRoom(int player_id);
	void PlayerJoinedRoom(const struct FUIRoomInfo& room, int master_id, TArray<struct FRoomUser> users);
	void PlayerInviteResponse(const struct FString& Name, int result);
	void PlayerInviteFriendResponse(const struct FString& Name, int result);
	void PlayerEquip(TArray<int> equips);
	void PlayerBeInvite(int invite_id, const struct FString& Name);
	void PlayerBeFriendInvite(int invite_id, const struct FString& Name);
	void OpenBoxRemind(const struct FText& remind);
	void ObtainNewItems(TArray<struct FBoxRewardItem> items);
	void ObtainNewItem(const struct FString& Name, class UTexture2D* icon);
	void ObtainNewBox(int item_id, const struct FString& Name, class UTexture2D* icon, bool is_need_key);
	void LoadUrl(const struct FString& URL);
	void JiHuoMaRemind(const struct FText& remind);
	void JiHuoMaItemAppend(const struct FString& Name, class UTexture2D* Texture);
	void InitTeamInfo(ESexType sex_type, int user_id, const struct FString& Name, int face_id, int skin_color_id, int hair_id, int hair_color_id, int State, int ready, bool in_room, TArray<int> equip_items, class UTexture2D* icon);
	void InitSkinSelectId(int skin_id, int Type, class UTexture2D* icon_texture, bool is_show);
	void InitServerList(TArray<int> server_list);
	void InitCharacterInfo(ESexType sex_type, const struct FString& Name, int face_id, int skin_color_id, int hair_id, int hair_color_id, int money);
	void Init(class AClientNetMessageHandle* Net_actor);
	void HideUrl();
	void HallRemind(const struct FText& remind);
	struct FString GetSaveUserName();
	struct FString GetSavePassWord();
	void GetNewSkin(int Type);
	void DeleteRoomComplete();
	void DeleteFriendComplete(int player_id);
	void CreateSkin(int skin_id, int Num, ESexType sex, int Type, class UTexture2D* item_texture);
	void CreateRooms(TArray<struct FUIRoomInfo> rooms);
	void CreateRoomComplete();
	void CreateOwnerKey(int item_id, const struct FString& Name, int Num);
	void CreateOwnerItemComplete();
	void CreateOwnerBox(int item_id, const struct FString& Name, int Num, class UTexture2D* icon, bool is_need_key);
	void CreateItem(int item_id, int Num, ESexType sex, class UTexture2D* item_texture, int item_level, const struct FString& item_name);
	void CreateBuyBox(int random_box, int fixed_box);
	void ComfirmMaster(int master_id);
	void ClearTeam(TArray<int> new_team_ids);
	void ClearHallItem();
	void ClearGoods();
	void ClearFriends();
	void ClearAllEquip();
	void CheckResetSortState();
	void BuyKeyResponse(int item_id, class UTexture2D* Texture);
	void BuyKeyRemind(const struct FText& remind);
	void BuyBoxRemind(const struct FText& remind);
	void AppendHallSkin(int item_id, int Num);
	void AppendHallItem(int item_id, int Num);
	void AppendGongGao(EGongGaoType Type, const struct FText& Info);
};


// Class WuXiaX.MiniMapCtrlUI
// 0x0008 (0x0210 - 0x0208)
class UMiniMapCtrlUI : public UUserWidget
{
public:
	class UWuXiaMiniMapWidget*                         mini_map_;                                                // 0x0208(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.MiniMapCtrlUI");
		return ptr;
	}


	void Vertical(bool State, bool IsDown);
	void MarkLocation();
	void MarkHoverItem(EGamepadMarkType MarkType);
	void MapScale(float Value);
	void Init();
	void Horizontal(bool State, bool IsRight);
	void GamepadIntoWidget();
};


// Class WuXiaX.Missile
// 0x0068 (0x0390 - 0x0328)
class AMissile : public AActor
{
public:
	unsigned char                                      UnknownData00[0x68];                                      // 0x0328(0x0068) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.Missile");
		return ptr;
	}


	void OnOverlapBegin(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void CallWhenDestroy();
};


// Class WuXiaX.MissileController
// 0x0078 (0x03A0 - 0x0328)
class AMissileController : public AActor
{
public:
	unsigned char                                      UnknownData00[0x70];                                      // 0x0328(0x0070) MISSED OFFSET
	int                                                targetPlayerNetID;                                        // 0x0398(0x0004) (Edit, BlueprintVisible, Net, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x039C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.MissileController");
		return ptr;
	}


	void SpawnEmitter(const struct FVector& Location, int index);
	int GetTargetPlayerID();
	void DestroyMissile(int index);
	void Client_Init(int64_t missileid, int64_t begintime, const struct FVector& spawnlocation, const struct FRotator& spawnrotation, const struct FVector& Direction, int launchplayerid, int64_t missilecontrollerid, int weapon_id, int skin_id);
	void CallWhenDestroy();
};


// Class WuXiaX.NetComponent
// 0x0000 (0x00F0 - 0x00F0)
class UNetComponent : public UActorComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.NetComponent");
		return ptr;
	}

};


// Class WuXiaX.NetManager
// 0x0050 (0x0378 - 0x0328)
class ANetManager : public AActor
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0328(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.NetManager");
		return ptr;
	}

};


// Class WuXiaX.NetMessageHandle
// 0x0040 (0x0368 - 0x0328)
class ANetMessageHandle : public AActor
{
public:
	struct FString                                     ip_addr_;                                                 // 0x0328(0x0010) (ZeroConstructor, Config)
	bool                                               reconnect_flag_;                                          // 0x0338(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0339(0x0003) MISSED OFFSET
	uint32_t                                           dedicated_port_;                                          // 0x033C(0x0004) (ZeroConstructor, IsPlainOldData)
	class AWuXiaXGameModeBase*                         game_mode_;                                               // 0x0340(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x20];                                      // 0x0348(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.NetMessageHandle");
		return ptr;
	}

};


// Class WuXiaX.NpcCharacter
// 0x0000 (0x0740 - 0x0740)
class ANpcCharacter : public ACharacter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.NpcCharacter");
		return ptr;
	}

};


// Class WuXiaX.OBAssistComponent
// 0x0000 (0x00F0 - 0x00F0)
class UOBAssistComponent : public UActorComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.OBAssistComponent");
		return ptr;
	}

};


// Class WuXiaX.OBBlueprintHelper
// 0x0000 (0x0028 - 0x0028)
class UOBBlueprintHelper : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.OBBlueprintHelper");
		return ptr;
	}


	class UTexture2D* STATIC_GetWeaponStateIconTexture(class UObject* WorldContext, int ID);
	class UTexture2D* STATIC_GetSkillIconTexture(class UObject* WorldContext, int ID);
	class UOBClientUIHelper* STATIC_GetOBClientUIHelper(class UObject* WorldContext);
	class AOBClientInfo* STATIC_GetOBClientInfo(class UObject* WorldContext);
	int STATIC_GetItemQuality(class UObject* WorldContext, int itemID);
	class UTexture2D* STATIC_GetItemIconTexture(class UObject* WorldContext, int ID);
	struct FString STATIC_GetItemIcon(class UObject* WorldContext, int ID);
	class UTexture2D* STATIC_GetEquipStateIconTexture(class UObject* WorldContext, int ID);
	class UTexture2D* STATIC_GetBuffIconTexture(class UObject* WorldContext, int buffID);
};


// Class WuXiaX.OBClientInfo
// 0x03E0 (0x0708 - 0x0328)
class AOBClientInfo : public AInfo
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0328(0x0018) MISSED OFFSET
	struct FRotator                                    target_view_rotator_;                                     // 0x0340(0x000C) (ZeroConstructor, IsPlainOldData)
	bool                                               need_camdir_rep_;                                         // 0x034C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x034D(0x0003) MISSED OFFSET
	int                                                view_target_netid_;                                       // 0x0350(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0354(0x0004) MISSED OFFSET
	class UOBClientUIHelper*                           UIHelper;                                                 // 0x0358(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x10];                                      // 0x0360(0x0010) MISSED OFFSET
	int                                                _my_net_id;                                               // 0x0370(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x394];                                     // 0x0374(0x0394) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WuXiaX.OBClientInfo");
		return ptr;
	}


	void UpdateTargetViewDir(int netID, const struct FRotator& rot);
	void UpdatePlayersPosition(TArray<struct FOBPlayerPosInfo> posInfos);
	void UpdatePlayersKillInfo(TArray<struct FOBPlayerKillInfo> killInfos);
	void UpdateHorseRideInfo(int horseID, int curDriverID, int curPassagerID);
	void SetViewRotTarget(int netID);
	void SetPlaneStartInfo(const struct FVector& Start, const struct FVector& End, int64_t StartTime);
	void SetLivePlayerNum(int Num);
	void SetGameStartTime(int64_t Time);
	void SetFlyEnd();
	void Server_UpdateOBLocation(const struct FVector& pos);
	void Server_RequestControlRotation(int charNetId);
	void Server_ClientInitReady();
	void OnXingfaLearningFinish(int ID, int PlayerID);
	void OnXingfaLearningFailed(int ID, int PlayerID);
	void OnXingfaLearning(int ID, int PlayerID);
	void OnXingfaEmerged(int ID, const struct FVector& pos, const struct FInteractiveInfo& Info);
	void OnTreasureBoxSapwned(int ID, const struct FVector& pos, const struct FInteractiveInfo& Info);
	void OnTreasureBoxOpened(int ID, int openedPlayerID);
	void OnTreasureBoxDestroyed(int ID);
	void OnServerInitDone(int netID);
	void OnPlayerTargetDetailInfoUpdate(const struct FOBPlayerTargetDetailInfo& Info);
	void OnPlayerGameOver(int netID);
	void OnPlayerConnectChange(int PlayerID, bool IsConnected);
	void OnParadropSpawned(const struct FOBParadropPosInfo& paradropPosInfo);
	void OnParadropItemPickedup(int worldID, int itemID);
	void OnParadropFinished(const struct FOBParadropItemInfo& paraDetailInfo);
	void OnMijingmenSpawned(int ID, const struct FVector& pos, const struct FInteractiveInfo& Info);
	void OnMijingmenOpened(int ID, int PlayerID);
	void OnGameOver(TArray<struct FOBStasticsInfo> result);
	void OnFightStateExpired(int ID);
	void OnFightStateCreate(const struct FOBFightState& Info);
	void OnCharacterRespawned(int PlayerID, const struct FVector& pos);
	void OnCharacterDyingRecover(int PlayerID, const struct FVector& pos);
	void OnCharacterDying(int PlayerID, const struct FVector& pos);
	void OnCharacterDied(int PlayerID, const struct FVector& pos);
	bool IsViewingTargetPlayer();
	bool IsShowTeamColor();
	void InitNewHorses(TArray<struct FOBHorseInfo> c_horseInfos);
	void InitNewCharacters(TArray<struct FOBPlayerInfo> c_playerInfos);
	void InitAll(const struct FOBGameInitInfo& initAllInfo);
	bool GetXinfaInfo(int worldID, struct FOBXinfaInfo* Info);
	int GetViewTargetPlayerID();
	bool GetTreasureboxInfo(int worldID, struct FOBTreasureBoxInfo* Info);
	float GetTimeToGameStart();
	int GetTeamNum();
